{
  "topics": [
    {
      "id": "one",
      "name": "Dasturlar va Tashabbuslar",
      "slug": "one"
    },
    {
      "id": "two",
      "name": "Mehmonlar va Hamkorliklar",
      "slug": "two"
    },
    {
      "id": "three",
      "name": "Tadbir va uchrashuvlar",
      "slug": "three"
    },
    {
      "id": "four",
      "name": "Xalqaro ta’lim imkoniyatlari",
      "slug": "four"
    },
    {
      "id": "five",
      "name": "Tanlovlar va olimpiadalar",
      "slug": "five"
    },
    {
      "id": "six",
      "name": "O'qituvchilar faoliyati va treninglar",
      "slug": "six"
    },
    {
      "id": "seven",
      "name": "Mukofot va e’tiroflar:",
      "slug": "seven"
    },
    {
      "id": "eight",
      "name": "IT, innovatsiya va startaplar",
      "slug": "eight"
    },
    {
      "id": "nine",
      "name": "Ilhomlantiruvchi uchrashuvlar",
      "slug": "nine"
    },
    {
      "id": "ten",
      "name": "O'quvchilar yutuqlari va imkoniyatlar",
      "slug": "ten"
    }
  ],
  "news": [
    {
      "id": "ysh-2026",
      "title": "HARVARD BITIRUVCHISI BILAN UCHRASHUV",
      "excerpt": "A Harvard bitiruvchisi Dmitri Solzhenitsyn maktabga tashrif buyurib, AQShdagi top universitetlar haqida ma’lumot berdi va o'quvchilar bilan savol-javob o'tkazdi.",
      "date": "08 okt 2025",
      "topics": ["two", "four", "nine", "ten"],
      "photo": "dimitriy_1.jpeg",
      "content": "\t8-oktyabrda maktabimizga Paulie Prep asoschisi,  St. Paul’s School va Harvard College bitiruvchisi-  Dmitri Solzhenitsyn tashrif buyurdi. Dmitri   tengdoshlari orasida eng iqtidorli o'quvchilardan biri bo'lib, AQShning eng nufuzli oliygohlariga kirish jarayoni bo'yicha katta tajribaga ega mutaxassis hisoblanadi.\n\tUchrashuv davomida Dmitri AQShning top universitetlari haqida batafsil ma’lumot berib, har bir universitetning standartlari, geografik joylashuvi, moliyaviy imkoniyatlari va imtiyozlarini solishtirib tahlil qildi. O'quvchilar bilan ochiq muloqot o'tkazib, ularni qiziqtirgan savollarga javob berdi.\n\tDmitri o'quvchilarimiz bilan o'tkazgan savol-javobda 11-05 sinf o'quvchisi Jahongir Hakimnazarov faol ishtirok etib,  to'g'ri javobi uchun Paulie Prep kursini yutib oldi.\n\tSobiq garvardchi bilan uchrashuv maktabimiz o'quvchilari uchun xalqaro ta’lim imkoniyatlarini yaqindan o'rganish va istiqboldagi maqsadlarini  aniq belgilash uchun zo'r tajriba bo'lishiga shubha yo'q! "
    },
    {
      "id": "summer-olympics-2025",
      "title": "“Prezident iqtidorli farzandlari” Milliy dasturi doirasida ochiq muloqot o'tkazildi",
      "excerpt": "“Prezident iqtidorli farzandlari” Milliy dasturi doirasida o'quvchilar va ota-onalar bilan ochiq muloqot o'tkazilib, dastur maqsadi, ta’lim imkoniyatlari va bepul tayyorgarlik haqida batafsil ma’lumot berildi.",
      "date": "sen 2025",
      "photo": "suhbat_1.jpeg",
      "topics": ["three", "ten"],
      "content": "\tMaktabgacha va maktab ta'limi vazirligi tomonidan “Prezident iqtidorli farzandlari” Milliy dasturi ishtirokchilari va ularning ota-onalari  ishtirokida  ochiq muloqot boʻlib oʻtdi.\n\tUnda vazirlik hamda Ixtisoslashtirilgan ta’lim muassasalari agentligi mas'ullari, Toshkent shahri maktablaridan saralangan 64 nafar iqtidorli o'quvchi va ularning ota-onalari ishtirok etdi.\n\tTadbir doirasida o'quvchilarga Milliy dasturning maqsad va vazifalari, o'quv dasturi haqida batafsil ma'lumot berildi.\n\tShuningdek, qo'shimcha darslar o'tiladigan platformalar, loyiha va maqsadlar haqida ham taqdimot qilindi.\n\tMa'lumot o'rnida: Milliy dastur 1500 nafar iqtidorli o'quvchilar uchun 2 yil davomida top-100 oliygohlarga bepul tayyorgarlikni o'z ichiga oladi."
    },
    {
      "id": "open-doors-oct-5",
      "title": "MAKTABIMIZDA 'APPLE' KOMPANIYASIDAN MEHMON",
      "excerpt": "“Apple” mintaqaviy rahbari Adilhan Kopabayev maktabga tashrif buyurib, o'quvchilarni ilhomlantirdi.",
      "date": "9 sen 2025",
      "photo": "apple.jpeg",
      "topics": ["three", "four", "five", "nine"],
      "content": "\t9-sentyabr kuni Muhammad al-Xorazmiy ixtisoslashtirilgan maktabiga dunyo miqyosida o'z o'rnini topgan, yosh bo'lsa-da katta yutuqlarga erishgan Adilhan Kopabayev tashrif buyurdi!\n\tAdilhan Kopabayev — hozirda 'Apple' kompaniyasining Markaziy Osiyo va Armaniston bo'yicha rahbari. U o'z yo'lini oddiy talabalikdan boshlab, turli davlat idoralari va yirik tashkilotlarda ishlagan, shuningdek, Brown Universitetida talabalik davrini o'tqizgan.\n\tUchrashuvda Adilhan yosh avlod muvaffaqiyatlari bilan tanishib, hayratda qoldi. U o'quvchilarni kelajak va hayot davomidagi imkoniyatlar haqida kengroq o'ylashga, qo'ldan boy bermaslikka va eng muhimi, o'ziga ishonishga chorlab qoladi.\n\tMuhammad al-Xorazmiy maktabi Adilhan Kopabayevga katta minnatdorchiligini bildiradi! Umid qilamizki, bu uchrashuv bizning yoshlarga yangi marralar sari dadil qadam tashlash uchun kuch bag'ishlaydi!"
    },
    {
      "id": "admission-2026-27",
      "title": "MYUNXEN TEXNIKA UNIVERSITETI PROFESSORI BILAN UCHRASHUV",
      "excerpt": "TUM professori maktabga tashrif buyurib, kimyo muhandisligi va Germaniyada o'qish imkoniyatlari haqida o'quvchilarga ma’lumot berdi.",
      "date": "02 sen 2025",
      "photo": "tum.jpeg",
      "topics": ["three", "five"],
      "content": "\tMuhammad al-Xorazmiy nomidagi ixtisoslashtirilgan maktabida dunyoning eng nufuzli oliygohlaridan biri — har yili Top 30 talik ro'yxatidan joy olib kelayotgan Myunxen Texnika Universiteti (TUM) professori mehmon bo'ldi.\n\tUchrashuv davomida o'quvchilar Kimyo muhandisligi sohasi, TUMdagi ta’lim va ilmiy faoliyat imkoniyatlari, shuningdek, Germaniyada o'qish sharoitlari va muhandislikdagi istiqbollar haqida bilib oldilar. Shu o'rinda bu univeritetga kirish jarayonlari va imtihon topshirish bosqichlari  haqida ham o'quvchilar kerakli ma'lumotlarga ega bo'ldilar.\n\tO'quvchilar o'zlari qiziqtirgan savollarni berib, universitet professoridan to'g'ridan-to'g'ri javob olishdi. Bu kabi tashriflar ularni xalqaro ta’limga tayyorlash va katta marralarga ilhomlantirishga xizmat qiladi."
    },
    {
      "id": "letovo-top-schools",
      "title": "IB TRENINGDA YONDASHUVLAR VA INTEGRATSIYA MASALASI",
      "excerpt": "Maktabda IB dasturi doirasida o'qituvchilar uchun zamonaviy metodika va fanlararo integratsiyaga bag'ishlangan seminar-trening o'tkazildi.",
      "date": "sep 2025",
      "photo": "ib.jpeg",
      "topics": ["seven"],
      "content": "\tBugun Muhammad al-Xorazmiy nomidagi ixtisoslashtirilgan maktabda xalqaro bakalavriat (IB) dasturi doirasida navbatdagi seminar-trening bo'lib o'tdi.\n\tMazkur treningda matematika, ona tili va adabiyot, informatika hamda jismoniy tarbiya fanlari o'qituvchilari faol ishtirok etdi. Tadbirning asosiy maqsadi – zamonaviy o'qitish uslublarini chuqurroq o'rganish, xususan, so'rovlarga asoslangan ta’lim strategiyalarini dars jarayonida samarali qo'llash yo'llarini aniqlashdan iborat bo'ldi.\n\tTrening davomida pedagoglar birgalikda  so'rovlar yordamida o'quvchilarning tanqidiy va mantiqiy fikrlashini rivojlantirish hamda fanlararo integratsiya imkoniyatlarini aniqlash va amaliyotda qo'llash  masalalarini muhokama qildilar.\n\tTrening yakunida ishtirokchilar ushbu metodik yondashuvlarni o'z darslarida tatbiq etish bo'yicha aniq reja va maqsadlarni belgilab oldilar."
    },
    { 
      "id": "letovo-social-media",
      "title": "O'QITUVCHILAR OLIMPIADASI RESPUBLIKA BOSQICHINING G'OLIBLARI ANIQLANDI",
      "excerpt": "Biologiya, matematika va informatika fanlari bo'yicha O'qituvchilar olimpiadasi respublika bosqichida g'oliblar aniqlandi va ular taqdirlandi.",
      "date": "sep 2025",
      "photo": "teacher.jpeg",
      "topics": ["six", "seven"],
      "content": "\tBiologiya, matematika hamda informatika va axborot texnologiyalari fanlaridan O'qituvchilar olimpiadasining Respublika bosqichi koʻtarinki kayfiyatda tashkil etildi.\n\tGʻoliblar bilan quyida tanishishingiz mumkin!\n\tBiologiya fanidan:\n\t\t1-oʻrin: Mirjalol Axmedov - Buxoro shahar, 35-sonli maktab.\n\t\t2-oʻrin: Ilhombek Turgʻinboyev - Fargʻona shahar, IMA 1-son IM.\n\t\t3-oʻrin: Ikromova Mohinabonu - Buxoro shahar, 35-sonli maktab.\n\tMatematika fanidan:\n\t\t1-oʻrin: Abdushukur Axadov - Sirdaryo viloyati, Guliston shahar, IMA IM.\n\t\t2-oʻrin: Elbek Toshpulatov - Toshkent viloyati, Angren shahar, IMA IM.\n\t\t3-oʻrin: Abbos Muhammedov - Buxoro shahar, IMA PM.\n\tInformatika va axborot texnologiya fanidan:\n\t\t1-oʻrin: Saidjalol Hasanov - Namangan shahar, IMA PM.\n\t\t2-oʻrin: Davron Avlakulov - Toshkent shahar, Yashnobod tumani, ITMA al-Xorazmiy maktabi.\n\t\t3-oʻrin: Mansurjon Kamolov - Navoiy viloyati, Qiziltepa tumani, 9-sonli maktab.\nGʻoliblarni tabriklaymiz!"
    },
    {
      "id": "summer-trips-2025",
      "title": "EʼTIROFGA LOYIQ TABRIK",
      "excerpt": "Informatika o'qituvchisi Xurshida Maxmudovna “Shuhrat” medali bilan taqdirlanib, kasaba uyushmasi tomonidan samimiy tabriklandi.",
      "date": "11 sen 2025",
      "photo": "shuhrat.jpeg",
      "topics": ["eight"],
      "content": "\tAvval xabar berganimizdek, O'zbekiston Respublikasi Prezidentining 11-sentabrdagi Farmoniga muvofiq, ta’lim-tarbiya sohasida yuksak fidoyilik ko'rsatgan maktabimiz informatika fani o'qituvchisi Zanjirova Xurshida Maxmudovna “Shuhrat” medali bilan taqdirlangan edi.\n\tUshbu yuksak mukofot munosabati bilan O'zbekiston ta’lim va fan xodimlari kasaba uyushmasi Toshkent shahar bo'linmasi Kengashi jamoasi ham ustozimizga samimiy tabrik yo'lladi. Tabriknomaning o'zida ustozimizning fidoyiligi, yosh avlodni bilimli va barkamol qilib tarbiyalashdagi xizmati, mehnatsevarligi va pedagogik mahorati yuksak e’tirof etilgan.\n\tBunday e’tiroflar ustozlarimiz mehnatining jamiyat tomonidan munosib qadrlanayotganini ko'rsatadi. Biz ham Xurshida Maxmudovnaning bu yutuqlaridan faxrlanamiz va kelgusidagi faoliyatlarida ulkan muvaffaqiyatlar tilaymiz!"
    },
    {
      "id": "exam-results-2025",
      "title": "BAA delegatsiyasi tashrifi",
      "excerpt": "BAA Prezident Devonining Ta’lim bo'yicha maslahatchisi Luay Jerudi boshchiligidagi delegatsiya maktabga tashrif buyurib, sharoitlar bilan tanishdi.",
      "date": "30 sep 2025",
      "photo": "baa.jpeg",
      "topics": ["three", "four"],
      "content": "\tBugun Muhammad  al-Xorazmiy nomidagi ixtisoslashtirilgan maktabida BAA Prezidenti Devonining Ta’lim masalalari bo'yicha maslahatchisi Luay Jerudi boshchiligidagi delegatsiya tashrif buyurdi.\n\tDelegatsiya vakillari maktabdagi yaratilgan shart-sharoitlar bilan yaqindan tanishdi."
    },
    {
      "id": "post1",
      "title": "MAAB INNOVATION BILAN UCHRASHUV",
      "excerpt": "MAAB Innovation vakillari maktabda uchrashuv o'tkazib, o'quvchilarga Data Science kurslariga grantlar taklif qildi.",
      "date": "26 sep 2025",
      "photo": "maab.jpeg",
      "topics": ["five", "nine", "eleven"],
      "content": "\t26-sentabr kuni Muhammad al-Xorazmiy nomidagi ixtisoslashtirilgan maktabning faollar zalida 9–11-sinf o'quvchilari uchun MAAB Innovation kompaniyasi vakillari bilan uchrashuv tashkil etildi.\n\tUchrashuv davomida kompaniya vakillari o'quvchilarimiz uchun maxsus imkoniyatni taqdim etishdi:\n\t\tO'quvchilar 15-oktyabrgacha kompaniya testida ishtirok etishlari mumkin.\n\t\tNatijada eng yuqori 15 talikka kirganlar 'Data Science' kurslariga 6 oy davomida 100% grant asosida qabul qilinadi.\n\t\tKeyingi o'rinlarni egallaganlar esa mos ravishda 90% yoki 80% grant bilan ta’minlanadi.\n\tShuni alohida ta’kidlash joizki, uchrashuvning o'zida maktabimiz o'quvchisi Xasanov Komronbek o'zining kuchli analitik fikrlash qobiliyatini namoyon etib, bevosita grant sovrindori bo'ldi.\n\tMAAB Innovation — Toshkentda faoliyat yurituvchi, IT Park rezidenti bo'lib, ma’lumotlar tahlili va zamonaviy IT yechimlari bilan shug'ullanadi.\n\tUshbu tashrif o'quvchilarimizga o'z bilimlarini sinovdan o'tkazish va yangi imkoniyatlarga yo'l ochdi deb umid qilamiz."
    },
    {
      "id": "post2",
      "title": "EL-YURT UMIDI FONDI VAKILLARI BILAN UCHRASHUV",
      "excerpt": "“El-yurt umidi” jamg'armasi vakillari maktabda uchrashuv o'tkazib, grant dasturlari va xorijiy ta’lim imkoniyatlari haqida ma’lumot berdi.",
      "date": "16 okt 2025",
      "photo": "eyuf.jpeg",
      "topics": ["three", "four", "five"],
      "content": "\tMuhammad al-Xorazmiy nomidagi ixtisoslashtirilgan maktabiga 16-oktyabr kuni “El-yurt umidi” jamg'armasi vakillari bilan uchrashuv tashkil qilindi.\n\tUchrashuvga tashrif buyurganlar orasida “El-yurt umidi” jamgʻarmasi ijrochi direktori oʻrinbosari Shuhrat Daminov, Raqamlashtirish va axborot-tahlil boshqarmasi bosh inspektori Qahramon Bektemirov, O'zbekiston Respublikasi Prezidenti huzuridagi Boshqaruv samaradorligi agentligining mas’ul xodimi O'tkir Abdukarimovlar ham bor edi.\n\tTashrif buyurganlar 10-11-sinf oʻquvchilariga jamgʻarma faoliyati haqida taqdimot namoyish etdilar va bu borada o'quvchilarni qiziqtirgan savollarga javob berdilar. Jamgʻarma faoliyati, grant dasturlariga hujjat topshirish tartibi va xorijiy ta’lim tizimi haqidagi batafsil ma’lumot berildi.\n\n\tBunday uchrashuvlar o'quvchilarimizning xalqaro ta’lim imkoniyatlari haqidagi tasavvurini kengaytirishda muhim ahamiyatga ega!"
    },
    {
      "id": "post3",
      "title": "BRISTOL UNIVERSITETI VAKILLARI BILAN UCHRASHUV",
      "excerpt": "Bristol universiteti vakillari maktabga tashrif buyurib, ta’lim tizimi va xalqaro qabul imkoniyatlari haqida o'quvchilar bilan suhbatlashdi.",
      "date": "17 okt 2025",
      "photo": "bristol.jpeg",
      "topics": ["three", "four", "ten"],
      "content": "\tMuhammad al-Xorazmiy nomidagi ixtisoslashtirilgan maktabda 17-oktabr kuni Buyuk Britaniyaning Bristol Universiteti vakillari bilan uchrashuv bo'lib o'tdi.\n\tTadbir davomida o'quvchilarimiz xalqaro ta'lim olamiga sayohat qilib, universitetning o'ziga xos ta'lim tizimi, xalqaro talabalar uchun qabul jarayonlari, grant dasturlari va talabalarga yaratilgan keng imkoniyatlar haqida batafsil ma'lumotlarga ega bo'lishdi.\n\tUshbu tashrif maktabimiz o'quvchilari uchun yuqori ta’lim sohasidagi ilg'or tajribalar bilan tanishish, kelajak rejalari va xalqaro dunyoqarashini kengaytirishda muhim ahamiyat kasb etadi!"
    }
  ]
}
